function getNum(num) {
var arr = (num.split(" "));

var a = ["сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"];
var b = ["десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"];
var c = ["один","два","три","четыре","пять","шесть","семь","восемь","девять"];
var d = ["одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"];


    var ourNum = [0, 0, 0];
    var i = 0;

    for (i = 0; i < 3; i++) {
        var word = arr[i];

        for (let j = 0; j < 9; j++) {

            if (word == a[j]) {
                ourNum[0] = ((j+1) * 100);
            }

            if (word == d[j]) {
                ourNum[1] = ((j+1) + 10);
            }

            if (word == b[j]) {
                ourNum[1] = ((j+1) * 10);
            }

            if (word == c[j]) {
                ourNum[2] = (j+1);
            }
        }

    }
    var arrToNumber = ourNum[0] + ourNum[1] + ourNum[2];
return arrToNumber;
}

